МояКонфа/src/Documents/пр_ДетализированныйГрафикПроекта/пр_ДетализированныйГрафикПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пр_ДетализированныйГрафикПроекта</name>
  <registerRecords>InformationRegister.пр_СвязьОборудованияИГрафикаРабот</registerRecords>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Блок1</name>
    <attributes>
      <name>ИДРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоАктализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецАктуализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>флИДРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименованиеРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоАктализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецАктуализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.пр_РаботыПроектаСооружений</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Блок2</name>
    <attributes>
      <name>ИДРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоАктализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецАктуализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>флИДРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименованиеРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоАктализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецАктуализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.пр_РаботыПроектаСооружений</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Блок3</name>
    <attributes>
      <name>ИДРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоАктализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецАктуализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>флИДРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименованиеРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоАктализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецАктуализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.пр_РаботыПроектаСооружений</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Блок4</name>
    <attributes>
      <name>ИДРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПоЦелевомуПлану</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоАктализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецАктуализировано</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>флИДРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименованиеРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецПоЦелевомуПлану</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНачалоАктализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКонецАктуализировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.пр_РаботыПроектаСооружений</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МояКонфа/src/Documents/пр_ДетализированныйГрафикПроекта/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузкаНаКлиентеЕксель();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНаКлиентеЕксель()
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("Activity ID","ИДРаботы");
	стЗаписываемыеКолонки.Вставить("Activity Name","НаименованиеРаботы");
	стЗаписываемыеКолонки.Вставить("KKS","КодОборудования");
	стЗаписываемыеКолонки.Вставить("Начало по ЦП","НачалоПоЦелевомуПлану");
	стЗаписываемыеКолонки.Вставить("Окончание по ЦП","КонецПоЦелевомуПлану");
	стЗаписываемыеКолонки.Вставить("Start","НачалоАктализировано");
	стЗаписываемыеКолонки.Вставить("Finish","КонецАктуализировано");
	
	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		ИмяЛиста = ЭксельКнига.Sheets(НомерЛиста).Name;
		НомерБлока = Число(СтрЗаменить(ИмяЛиста,"Блок",""));
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(1, 1) ;

		
		СписокСтрок = Новый СписокЗначений;

		Для НомерСтроки = 2 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонки1С = стЗаписываемыеКолонки.Получить(строкаШапка.Columns(НомерКолонки).value);
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонки1С <> Неопределено Тогда
					ДанныеСтроки.Вставить(ИмяКолонки1С,  ЗначениеВЯчейке);
				КонецЕсли;

	
			КонецЦикла;
			
			ОбработкаПрерыванияПользователя();			
			Если ДанныеСтроки.Количество()=0 Тогда Продолжить;КонецЕсли;

			НаименованиеРаботы="";
			ДанныеСтроки.Свойство("НаименованиеРаботы",НаименованиеРаботы);
			Если НаименованиеРаботы=Неопределено Тогда Продолжить;КонецЕсли;
			
			СписокСтрок.Добавить(ДанныеСтроки);
			//Если  НомерСтроки>50 Тогда Прервать; КонецЕсли;
			
			//Возврат;
		КонецЦикла;
		
		ЗагрузитьГрафикДляБлока(НомерБлока,СписокСтрок);
		//Прервать;
	КонецЦикла;
	
	//РаскраситьНеВалидныеСтрокиКрасным();

	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

Функция НайтиНоменклатуру(Артикул)
	
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	
КонецФункции

Функция НайтиРаботу(ИДРаботы,НомерБлока)
	
ОбщегоНазначения_аккую.НайтиРаботуВГрафике(ИДРаботы,НомерБлока);

КонецФункции


Процедура РаскраситьНеВалидныеСтрокиКрасным()
	ОбщегоНазначения_аккую.РаскраситьНеВалидныеСтрокиКрасным(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГрафикДляБлока(НомерБлока,СписокСтрок)
	Для Каждого СпСтрока из СписокСтрок Цикл 
		
		стКолонки = СпСтрока.Значение;
		
		ИДРаботы="";
		стКолонки.Свойство("ИДРаботы",ИДРаботы);
		РаботаСсылка = НайтиРаботу(ИДРаботы,НомерБлока);
		стКолонки.Вставить("Работа",РаботаСсылка);
		
		Артикул="";
		стКолонки.Свойство("КодОборудования",Артикул);
		Номенклатура = НайтиНоменклатуру(Артикул);
		стКолонки.Вставить("Номенклатура",Номенклатура);
		
		стКолонки.Вставить("НомерБлока",НомерБлока);
		
		Строки = ЭтотОбъект.Объект["Блок"+Строка(НомерБлока)].НайтиСтроки(Новый Структура("Работа",РаботаСсылка));
		Если Строки.Количество() > 0 Тогда
			строкаТЧ = Строки[0];
		Иначе
			строкаТЧ = ЭтотОбъект.Объект["Блок"+Строка(НомерБлока)].Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,стКолонки);
		                                                           
	    Состояние("Заполнение по Блоку"+Строка(НомерБлока)+" " + Строка(СписокСтрок.Индекс(СпСтрока))+"/"+Строка(СписокСтрок.Количество()));
	КонецЦикла;
	
КонецПроцедуры
